Repository: DIKO-Doc/DIKO-Doc.github.io
Catalog: cht-to-eng/cht-to-eng-omegat.tmx
Source language: zh_tw
Languages: en

source: #include "..." search starts here:
en: #include "..." 搜尋從這裡開始：

source: #include <...> search starts here:
en: #include <...> 搜尋從這裡開始：

source: #pragma GCC memregs must precede any function decls
en: #pragma GCC memregs 必須出現在所有函式宣告之前

source: #pragma GCC visibility must be followed by push or pop
en: #pragma GCC visibility 後面必須跟 push 或 pop

source: #pragma GCC visibility push() must specify default, internal, hidden or protected
en: #pragma GCC visibility push() 必須指定 default、internal、hidden 或 protected

source: #pragma GHS endXXX does not match previous startXXX
en: #pragma GHS endXXX 與先前的 startXXX 不匹配

source: #pragma GHS endXXXX found without previous startXXX
en: #pragma GHS endXXXX 前沒有 startXXX

source: #pragma extern_prefix not supported on this target
en: #pragma extern_prefix 在此目標平臺上不受支援

source: #pragma implementation for %qs appears after file is included
en: 檔案在 %qs 的 #pragma implementation 出現前已被包含

source: #pragma pack has no effect with -fpack-struct - ignored
en: 指定了 -fpack-struct 時 #pragma pack 無效 - 已忽略

source: #pragma redefine_extname ignored due to conflict with __asm__ declaration
en: #pragma redefine_extname 因與 __asm__ declaration 衝突而被忽略

source: #pragma redefine_extname ignored due to conflict with previous #pragma redefine_extname
en: #pragma redefine_extname 因與先前的 #pragma redefine_extname 衝突而被忽略

source: #pragma redefine_extname ignored due to conflict with previous rename
en: #pragma redefine_extname 因與先前的 rename 衝突而被忽略

source: #pragma vtable no longer supported
en: #pragma vtable 不再受支援

source: $ operand number used after format without operand number
en: $ 運算元號在不使用運算元號的格式後被使用

source: %(name)s (%(cmd)s not installed)
en: %(name)s（%(cmd)s 未安裝）

source: %(name)s (Invalid repository)
en: %(name)s（無效的倉儲）

source: %<%%%> constraint used with last operand
en: %<%%%> 約束用於最後一個運算元

source: %<%%%c%> yields only last 2 digits of year
en: %<%%%c%> 只給出 2 位表示的年份

source: %<%%%c%> yields only last 2 digits of year in some locales
en: %<%%%c%> 在某些區域設定下只給出 2 位表示的年份

source: %<%D::%D%> is not a member of %qT
en: %<%D::%D%> 不是 %qT 的成員

source: %<%T::%D%> is not a valid declarator
en: %<%T::%D%> 不是一個有效的宣告

source: %<%T::%D%> names constructor
en: %<%T::%D%> 指定了建構式

source: %<%T::%D%> names constructor in %qT
en: %<%T::%D%> 在 %qT 內指定了建構式

source: %<%T::%D%> names destructor
en: %<%T::%D%> 指定了解構函式

source: %<%s %E%> declared inside parameter list
en: %<%s %E%> 在參數表內部宣告

source: %<&%> constraint used with no register class
en: %<&%> 約束未與暫存器類型一起使用

source: %<-gnat%> misspelled as %<-gant%>
en: %<-gnat%> 被錯誤地拼寫為 %<-gant%>

source: %<...%> has invalid operand number
en: %<...%> 運算元號不正確

source: %<::%D%> has not been declared
en: %<::%D%> 尚未宣告

source: %<::main%> must return %<int%>
en: %<::main%> 必須回傳 %<int%>

source: %<<:%> is an alternate spelling for %<[%>. Insert whitespace between %<<%> and %<::%>
en: %<<:%> 是 %<[%> 的另一種拼法。請在 %<<%> 和 %<::%> 間加上空格

source: %<<::%> cannot begin a template-argument list
en: 不能以 %<<::%> 開始一個範本引數清單

source: %<@encode%> must specify a type as an argument
en: %<@encode%> 必須指定一個類型做為引數

source: %<@end%> missing in implementation context
en: 實作上下文中缺少 %<@end%>

source: %<@end%> must appear in an @implementation context
en: %<@end%> 必須出現在 @implementation 上下文中

source: %<@try%> without %<@catch%> or %<@finally%>
en: %<@try%> 缺少對應的 %<@catch%> 或 %<@finally%>

source: %<__BELOW100__%> attribute only applies to variables
en: 屬性 %<__BELOW100__%> 只對變數類型起作用

source: %<__alignof%> applied to a bit-field
en: 將 %<__alignof%> 用於位元段

source: %<__builtin_longjmp%> second argument must be 1
en: %<__builtin_longjmp%> 的第二個引數必須是 1

source: %<__gcc_host_wide_int__%> is not defined as %<long%> or %<long long%>
en: %<__gcc_host_wide_int__%> 未被定義為 %<long%> 或 %<long long%>

source: %<__gcc_host_wide_int__%> is not defined as a type
en: %<__gcc_host_wide_int__%> 未被定義為一個類型

source: %<__thread%> before %<extern%>
en: %<__thread%> 出現在 %<extern%> 之前

source: %<__thread%> before %<static%>
en: %<__thread%> 出現在 %<static%> 之前

source: %<__thread%> used with %<auto%>
en: %<__thread%> 與 %<auto%> 一起使用

source: %<__thread%> used with %<register%>
en: %<__thread%> 與 %<register%> 一起使用

source: %<__thread%> used with %<typedef%>
en: %<__thread%> 與 %<typedef%> 一起使用

source: %<and%> of mutually exclusive equal-tests is always 0
en: 對兩個互斥的相等比較取 %<and%> 的結果永遠是 0

source: %<asm%> operand constraint incompatible with operand size
en: %<asm%> 運算元的約束與運算元大小不相容

source: %<asm%> operand requires impossible reload
en: %<asm%> 要求不可能的重新載入

source: %<auto%> in file-scope empty declaration
en: 檔案作用欄位中出現 %<auto%> 空宣告

source: %<explicit%> can only be specified for constructors
en: 只能為建構式指定 %<explicit%>

source: %<friend%> can only be specified inside a class
en: %<friend%> 只能在類別中指定

source: %<inline%> is not allowed in declaration of friend template specialization %qD
en: %<inline%> 不允許用於夥伴範本特例化 %qD 的宣告

source: %<inline%> specified for friend class declaration
en: 夥伴函式宣告中出現了 %<inline%>

source: %<inline%> specifier invalid for function %qs declared out of global scope
en: 在全域作用欄位外為函式 %qs 指定 %<inline%> 無效

source: %<location_t%> is not defined as a type
en: %<location_t%> 未被定義為一個類型

source: %<locus%> is not defined as a type
en: %<locus%> 未被定義為一個類型

source: %<long long long%> is too long for GCC
en: %<long long long%> 對 GCC 來說太長了

source: %<operator delete%> must return type %qT
en: %<operator delete%> 必須回傳 %qT

source: %<operator delete%> takes type %qT as first parameter
en: %<operator delete%> 的第一個參數類型為 %qT

source: %<operator new%> must not return NULL unless it is declared %<throw()%> (or -fcheck-new is in effect)
en: %<operator new%> 不能回傳 NULL，除非它被宣告為 %<throw()%> (或 -fcheck-new 起作用)

source: %<operator new%> must return type %qT
en: %<operator new%> 必須回傳 %qT

source: %<operator new%> takes type %<size_t%> (%qT) as first parameter
en: %<operator new%> 的第一個參數類型為 %<size_t%> (%qT)

source: %<operator=%> should return a reference to %<*this%>
en: %<operator=%> 應當回傳一個對 %<*this%> 的參照

source: %<or%> of unmatched not-equal tests is always 1
en: 對兩個不匹配的不等比較取 %<or%> 的結果總為 1

source: %<register%> in file-scope empty declaration
en: 檔案作用欄位中出現 %<register%> 空宣告

source: %<return%> with no value, in function returning non-void
en: 在有回傳值的的函式中，%<return%> 不帶回傳值

source: %<static%> may not be used when defining (as opposed to declaring) a static data member
en: 與宣告不同，定義靜態資料成員時不能使用 %<static%>

source: %<static%> specified invalid for function %qs declared out of global scope
en: 在全域作用欄位外為函式 %qs 指定 %<static%> 無效

source: %<struct %E%> declared in %<for%> loop initial declaration
en: %<struct %E%> 宣告於 %<for%> 循環初始宣告中

source: %<template%> (as a disambiguator) is only allowed within templates
en: 做為消歧義的 %<template%> 只能用於範本內

source: %<this%> is unavailable for static member functions
en: 靜態成員函式中不能使用 %<this%>

source: %<tree%> is not defined as a pointer type
en: %<tree%> 未被定義為一個指標類型

source: %<tree%> is not defined as a type
en: %<tree%> 未被定義為一個類型

source: %<union %E%> declared in %<for%> loop initial declaration
en: %<union %E%> 宣告於 %<for%> 循環初始宣告中

source: %<void%> as only parameter may not be qualified
en: %<void%> 做為僅有的參數時不能被限定

source: %<void%> must be the only parameter
en: %<void%> 必須是僅有的參數

source: %E qualifier ignored on asm
en: %E 限定在 asm 上被忽略

source: %d (unknown)
en: %d（不明）

source: %d branch
en: %d 個分支

source: %d entries
en: %d-gè entris

source: %d entry
en: %d-gè entri

source: %d error
en: %d-gè öra

source: %d errors
en: %d-gè öras

source: %d is greater than local port max %d
en: %d 大於本地端口最大值 %d

source: %d issue with the translation found.
en: %d-gè issyu wiŧ transleiçion fainden.

source: %d issues with the translation found.
en: %d-gè issyus wiŧ transleiçion fainden.

source: %d out of %d online suggestion left.
en: %d-gè (toutol %d-gè) onlain sùjjesçion left.

source: %d out of %d online suggestions left.
en: %d-gè (toutol %d-gè) onlain sùjjesçions left.

source: %d unpushed commit
en: %d 項未推送的提交

source: %d. route cannot be a default route
en: %d. route不能是默認路由

source: %d. route is invalid
en: %d。路徑不合規定

source: %i line of file “%s” was not loaded correctly.
en: %i-gè lain in fayl «%s» wa not dū louden korrektli.

source: %i lines of file “%s” were not loaded correctly.
en: %i-gè lains in fayl «%s» wa not dū louden korrektli.

source: %i-bit mode not compiled in
en: 未編譯入對 %i 位模式的支援

source: %q#D conflicts with previous using declaration %q#D
en: %q#D 與先前的 using 宣告 %q#D 衝突

source: %q#D hides constructor for %q#T
en: %q#D 隱藏了 %q#T 的建構式

source: %q#D is a static data member; it can only be initialized at its definition
en: %q#D 是一個靜態資料成員；它只能在定義時被初始化

source: %q#D is not a non-static data member of %qT
en: %q#D 不是 %qT 的非靜態資料成員

source: %q#D is not a static member of %q#T
en: %q#D 不是 %q#T 的靜態成員

source: %q#D redeclared as different kind of symbol
en: %q#D 被重新宣告為不同意義的符號

source: %q#T has pointer data members
en: %q#T 有指標資料成員

source: %q#T is not a template
en: %q#T 不是一個範本

source: %q#T only defines a private destructor and has no friends
en: %q#T 僅定義了一個私有解構函式且沒有夥伴

source: %q#T only defines private constructors and has no friends
en: %q#T 僅定義了一個私有建構式且沒有夥伴

source: %q#T used where a %qT was expected
en: 不應使用 %q#T 而應使用 %qT

source: %q#T used where a floating point value was expected
en: 需要浮點數值時使用了 %q#T

source: %q+#D cannot be declared
en: 無法宣告 %q+#D

source: %q+#D cannot be overloaded
en: %q+#D 無法被多載

source: %q+#D is inaccessible
en: %q+#D 無法存取

source: %q+#D is private
en: %q+#D 是私有的

source: %q+#D is protected
en: %q+#D 是保護的

source: %q+#D previously declared here
en: %q+#D 已在此宣告過

source: %q+#D previously defined here
en: %q+#D 已在此定義過

source: %q+D already declared with dllexport attribute: dllimport ignored
en: %q+D 已被宣告為具有 dllexport 屬性：忽略 dllimport

source: %q+D contains empty classes which may cause base classes to be placed at different locations in a future version of GCC
en: %q+D 包含一個空類別，基礎類別的位置在 GCC 的未來版本可能會有變化

source: %q+D declared as a friend
en: %q+D 宣告為夥伴

source: %q+D declared with an exception specification
en: %q+D 宣告時有異常指定

source: %q+D has a previous declaration as %q#D
en: %q+D 早先被宣告為 %q#D

source: %q+D invalid in %q#T
en: %q+D 無效，在 %q#T 中

source: %q+D is too small to hold all values of %q#T
en: %q+D 太小而不能存放 %q#T 的所有可能值

source: %q+D is usually a function
en: %q+D 一般是一個函式

source: %q+D may not be static because it is a member of a union
en: %q+D 不能是靜態的，因為它是聯合的成員

source: %q+D may not have reference type %qT because it is a member of a union
en: %q+D 不能有參照類型 %qT，因為它是聯合的成員

source: %q+D redeclared as different kind of symbol
en: %q+D 被重新宣告為不同意義的符號

source: %q+D redeclared without dllimport attribute after being referenced with dll linkage
en: %q+D 重宣告時沒有 dllimport 屬性，但已被做為 dllimport 連結參照過

source: %q+D redeclared without dllimport attribute: previous dllimport ignored
en: %q+D 重宣告時沒有 dllimport 屬性：忽略先前的 dllimport

source: %q+D takes only zero or two arguments
en: %q+D 只帶零或兩個參數

source: %q+D used prior to declaration
en: %q+D 在宣告前使用

source: %q+D was hidden
en: %q+D 被隱藏

source: %q+D will be initialized after
en: %q+D 將隨後被初始化

source: %q+F declared %<static%> but never defined
en: %q+F 宣告為 %<static%> 卻從未定義過

source: %q+F used but never defined
en: %q+F 使用過但從未定義

source: %q+T has a previous declaration here
en: %q+T 先前在此處有過宣告

source: %qD attribute directive ignored
en: 指定 %qD 屬性被忽略

source: %qD cannot appear in a constant-expression
en: %qD 不能出現在常數運算式中

source: %qD cannot be declared virtual, since it is always static
en: %qD 不能宣告為虛函式，因為它總是靜態的

source: %qD cannot have default arguments
en: %qD 不能有預設參數

source: %qD has an incomplete type
en: %qD 類型不完全

source: %qD has no member named %qE
en: %qD 沒具名為 %qE 的成員

source: %qD has the same name as the class in which it is declared
en: %qD 與其宣告所在的類別同名

source: %qD is already a friend of %qT
en: %qD 已經是 %qT 的夥伴

source: %qD is already a friend of class %qT
en: %qD 已經是類別 %qT 的夥伴

source: %qD is already declared in this scope
en: %qD 已在此作用欄位中宣告過

source: %qD is already defined in class %qT
en: %qD 已在類別 %qT 中定義過

source: %qD is already defined in the class %qT
en: %qD 已在類別 %qT 中定義過

source: %qD is both a direct base and an indirect virtual base
en: %qD 既是一個直接基礎類別又是一個間接虛基礎類別

source: %qD is not a class or namespace
en: %qD 既不是類別也不是命名空間

source: %qD is not a function template
en: %qD 不是一個函式範本

source: %qD is not a member of %qD
en: %qD 不是 %qD 的成員

source: %qD is not a member of %qT
en: %qD 不是 %qT 的成員

source: %qD is not a member template function
en: %qD 不是一個成員範本函式

source: %qD is not defined outside of function scope
en: %qD 在函式作用欄位外未被定義

source: %qD is thread-local and so cannot be dynamically initialized
en: %qD 是執行緒區域性的，所以不能被動態地初始化

source: %qD may not be declared as static
en: %qD 不能被宣告為靜態的

source: %qD may not be declared within a namespace
en: %qD 不能在命名空間宣告

source: %qD must be a nonstatic member function
en: %qD 必須是一個非靜態的成員函式

source: %qD must be either a non-static member function or a non-member function
en: %qD 必須是一個非靜態成員函式或非成員函式

source: %qD must take %<void%>
en: %qD 必須有 %<void%> 類型

source: %qD must take either one or two arguments
en: %qD 必須帶 1 或 2 個引數

source: %qD must take either zero or one argument
en: %qD 必須帶 0 或 1 個引數

source: %qD must take exactly one argument
en: %qD 帶且僅帶 1 個引數

source: %qD must take exactly two arguments
en: %qD 帶且僅帶 2 個引數

source: %qD not declared
en: %qD 未宣告

source: %qD not defined
en: %qD 未定義

source: %qD redeclared with different access
en: %qD 重宣告時有不同的可存取性

source: %qD should never be overloaded
en: %qD 永遠不應該被多載

source: %qD should return by value
en: %qD 應當回傳值而非參照

source: %qD was declared %<extern%> and later %<static%>
en: %qD 先被宣告為 %<extern%> 後又被宣告為 %<static%>

source: %qD was not declared in this scope
en: %qD 在此作用欄位中尚未宣告

source: %qE attribute can only be applied to Java class definitions
en: 只能為 Java 類別定義套用 %qE 屬性

source: %qE attribute can only be applied to class definitions
en: 只能為類別定義套用 %qE 屬性

source: %qE attribute ignored
en: %qE 屬性被忽略

source: %qE attribute ignored for %qE
en: %qE 屬性為 %qE 所忽略

source: %qE attribute ignored on types
en: %qE 屬性在類型上被忽略

source: %qE attribute is not supported on this platform
en: %qE 屬性在此平台上不受支援

source: %qE attribute only applies to variadic functions
en: %qE 屬性只能用於帶可變參數函式

source: %qE attribute requires prototypes with named arguments
en: %qE 屬性需要帶具名引數的原型

source: %qE does not have class type
en: %qE 不是一個類別

source: %qE does not name a type
en: %qE 沒有命名一個類型

source: %qE fails to be a typedef or built in type
en: %qE 不是一個 typedef 類型，也不是一個內建類型

source: %qE is an unrecognized format function type
en: %qE 是一個無法辨識的格式字串函式類型

source: %qE is not a template
en: %qE 不是一個範本

source: %qE is not a valid template argument for type %qT because it is a pointer
en: %qE 不是類型 %qT 的有效範本引數，因為它是一個指標

source: %qE is not a valid template argument for type %qT because it is of type %qT
en: %qE 不是類型 %qT 的有效範本引數，因為它的類型是 %qT

source: %qE is not a valid template argument for type %qT because object %qD has not external linkage
en: %qE 不是類型 %qT 的有效範本引數，因為物件 %qD 沒有外部連結

source: %qE is not at beginning of declaration
en: %qE 沒有出現在宣告的開頭

source: %qE is obsolete; g++ vtables are now COM-compatible by default
en: %qE 已過時：g++ 的虛函式表現在預設與 COM 相容

source: %qT has no member named %qE
en: %qT 沒具名為 %qE 的成員

source: %qT has no non-static data member named %qD
en: %qT 沒具名為 %qD 的非靜態資料成員

source: %qT is a variably modified type
en: %qT 是一個可變類型

source: %qT is already a friend of %qT
en: %qT 已經是 %qT 的夥伴

source: %qT is an ambiguous base of %qT
en: %qT 是 %qT 的有歧義的基礎類別

source: %qT is an inaccessible base of %qT
en: %qT 是 %qT 不可存取的基礎類別

source: %qT is not a base of %qT
en: %qT 不是 %qT 的基礎類別

source: %qT is not a class or namespace
en: %qT 既不是類別也不是命名空間

source: %qT is not a class, struct, or union type
en: %qT 不是類別、結構或聯合類型

source: %qT is not a member class template of %qT
en: %qT 不是 %qT 的成員類別範本

source: %qT is not a member of %qT
en: %qT 不是 %qT 的成員

source: %qT is not a namespace
en: %qT 不是一個命名空間

source: %qT is not a nested class of %qT
en: %qT 不是 %qT 的巢狀類別

source: %qT is not a template
en: %qT 不是一個範本

source: %qT is not a template type
en: %qT 不是一個範本類型

source: %qT is promoted to %qT when passed through %<...%>
en: 透過 %<...%> 傳遞時 %qT 被提升為 %qT

source: %qT referred to as %qs
en: %qT 做為 %qs 被參照

source: %qT referred to as enum
en: %qT 做為列舉被參照

source: %qT resolves to %qT, which is is not a class type
en: %qT 被解析到非類別類型 %qT

source: %qT resolves to %qT, which is not an enumeration type
en: %qT 被解析到非列舉類型 %qT

source: %qV qualifiers cannot be applied to %qT
en: %qV 限定符不能套用到 %qT 上

source: %qs attribute only applies to functions
en: %qs 屬性只能套用於函式

source: %qs can only be specified for functions
en: 只能為函式指定 %qs

source: %qs declared as function returning a function
en: %qs 宣告為回傳一個函式的函式

source: %qs declared as function returning an array
en: %qs 宣告為回傳一個陣列的函式

source: %qs expects a constant argument
en: %qs 需要一個常數引數

source: %qs has both %<extern%> and initializer
en: %qs 既有 %<extern%> 又有初始值設定

source: %qs has overflowed
en: %qs 已溢出

source: %qs initialized and declared %<extern%>
en: %qs 已初始化，卻又被宣告為 %<extern%>

source: %qs is not a gcov data file
en: %qs 不是一個 gcov 資料檔案

source: %qs is not a valid output file
en: %qs 不是一個有效的輸出檔案

source: %qs uses dynamic stack allocation
en: %qs 使用動態堆疊指派

source: %s (%s) cloned as %s (%s).
en: %s （%s) 克隆為 %s （%s).

source: %s (local, merge, remote)
en: %s (本地、合併、遠端)

source: %s (remote, merge, local)
en: %s (遠端、合併、本地)

source: %s (repository, working)
en: %s (倉儲、作業中)

source: %s (working, repository)
en: %s (作業中、倉儲)

source: %s Format
en: %s Formät

source: %s Network
en: %s 網路

source: %s VPN connection
en: %s VPN連接

source: %s argument is missing
en: %s 爭論缺失

source: %s at %L must be INTEGER
en: %s (%L 處)必須是 INTEGER

source: %s attribute conflicts with %s attribute at %L
en: %s 屬性與 %s 屬性在 %L 處衝突

source: %s cannot be used in asm here
en: %s 不能在這裡用於 asm

source: %s does not support %%n$ operand number formats
en: %s 不支援 %%n$ 運算元號格式字串

source: %s does not support %s
en: %s 不支援 %s

source: %s does not support %s with the %<%%%c%> %s format
en: %s 不支援 %s 出現在 %<%%%c%> %s 格式字串中

source: %s does not support block_ends_with_call_p
en: %s 不支援 block_ends_with_call_p

source: %s does not support block_ends_with_condjump_p
en: %s 不支援 block_ends_with_condjump_p

source: %s does not support can_duplicate_block_p
en: %s 不支援 can_duplicate_block_p

source: %s does not support can_merge_blocks_p
en: %s 不支援 can_merge_blocks_p

source: %s does not support create_basic_block
en: %s 不支援 create_basic_block

source: %s does not support delete_basic_block
en: %s 不支援 delete_basic_block

source: %s does not support duplicate_block
en: %s 不支援 duplicate_block

source: %s does not support flow_call_edges_add
en: %s 不支援 flow_call_edges_add

source: %s does not support merge_blocks
en: %s 不支援 merge_blocks

source: %s does not support move_block_after
en: %s 不支援t move_block_after

source: %s does not support predict_edge
en: %s 不支援 predict_edge

source: %s does not support predicted_by_p
en: %s 不支援 predicted_by_p

source: %s does not support redirect_edge_and_branch_force
en: %s 不支援 redirect_edge_and_branch_force

source: %s does not support split_block
en: %s 不支援 split_block

source: %s does not support split_edge
en: %s 不支援 split_edge

source: %s does not support the %<%%%c%> %s format
en: %s 不支援 %<%%%c%> %s 格式

source: %s does not support the %<%%%s%c%> %s format
en: %s 不支援 %<%%%s%c%> %s 格式

source: %s does not support the %qs %s length modifier
en: %s 不支援 %qs %s 長度修飾符

source: %s expression list treated as compound expression
en: %s 運算式清單被看作複合運算式

source: %s format
en: %s formät

source: %s ignored with %s and %<%%%c%> %s format
en: %s 與 %s 和 %<%%%c%> %s 格式字串合用時被忽略

source: %s ignored with %s in %s format
en: %s 和 %s 出現在 %s 格式字串中時被忽略

source: %s in %s
en: %s，位於 %s

source: %s is not supported by this configuration
en: %s 不為這個配置所支援

source: %s returned %d exit status
en: %s 以回傳值 %d 離開

source: %s statement at %C cannot follow %s statement at %L
en: %s 敘述在 %C 處不能跟隨 %s 敘述在 %L 處

source: %s statement expected at %L
en: 需要 %s 敘述在 %L 處

source: %s statement must appear in a MODULE
en: %s 敘述必須出現在 MODULE 中

source: %s tag at %L must be scalar
en: %s 標記在 %L 處必須是標量

source: %s used with %<%%%c%> %s format
en: %s 與 %<%%%c%> %s 格式並用

source: %s — local
en: %s — 本地

source: %s — remote
en: %s — 遠端

source: %s — repository
en: %s — 倉儲

source: %s%sGGC heuristics: --param ggc-min-expand=%d --param ggc-min-heapsize=%d
en: %s%sGGC 準則：--param ggc-min-expand=%d --param ggc-min-heapsize=%d

source: %s. Please use --help to see a list of valid options.
en: %s。請使用 --help 來查看有效選項的清單。

source: %s: %d basic blocks and %d registers
en: %s：%d 個基本區塊和 %d 個暫存器

source: %s: %s compiler not installed on this system
en: %s：此系統未安裝 %s 編譯器

source: %s: --param arguments should be of the form NAME=VALUE
en: %s：--param 引數的形式應該為「名稱=值」

source: %s: Cannot open output file: %s
en: %s：無法開啟輸出檔案：%s

source: %s: PCH file was invalid
en: %s：PCH 檔案無效

source: %s: cannot open as COFF file
en: %s：無法開啟 COFF 檔案

source: %s: couldn%'t open PCH file: %m
en: %s：無法開啟 PCH 檔案：%m

source: %s: device created
en: %s: 設備創建

source: %s: don't retry loading plugin which already failed previously
en: %s: 不要重試以前已經失敗的加載插件

source: %s: linker input file unused because linking not done
en: %s：未使用連結器輸入檔案，因為連結尚未完成

source: %s: not a COFF file
en: %s：不是一個 COFF 檔案

source: %s:%d: Illegal preprocessor directive
en: %s:%d：無效的預包含指示

source: %s:%d: confused by earlier errors, bailing out
en: %s：%d：不能從先前的錯誤中恢復，離開

source: %s:%d: file %s left but not entered
en: %s:%d: 檔案 %s 被留下但未進入

source: %s:'%s' has arcs from exit block
en: %s：「%s」有來自出口區塊的弧

source: %s:'%s' has arcs to entry block
en: %s：「%s」有去往入口塊的弧

source: %s:'%s' lacks entry and/or exit blocks
en: %s：「%s」缺少入口/出口塊

source: %s:already seen blocks for '%s'
en: %s:已經看到「%s」的區塊

source: %s:cannot open graph file
en: %s：無法開啟圖檔案

source: %s:corrupted
en: %s：已損壞

source: %s:graph is unsolvable for '%s'
en: %s：圖為「%s」不可解

source: %s:no lines for '%s'
en: %s：「%s」沒有列

source: %s:not a gcov data file
en: %s：不是一個 gcov 資料檔案

source: %s:not a gcov graph file
en: %s：不是一個 gcov 圖檔案

source: %s:overflowed
en: %s：溢出

source: %s:profile mismatch for '%s'
en: %s：樣本檔案與「%s」不匹配

source: %s:source file is newer than graph file '%s'
en: %s：來源檔案較圖檔案「%s」新

source: %s:stamp mismatch with graph file
en: %s：時間戳記與圖檔案不匹配

source: %s:unknown function '%u'
en: %s：不明函式「%u」

source: %s:version '%.4s', prefer '%.4s'
en: %s：版本「%.4s」，偏好「%.4s」

source: %s:version '%.4s', prefer version '%.4s'
en: %s：版本「%.4s」，偏好版本「%.4s」

source: &About
en: À&baut

source: &About Poedit
en: À&baut Poedit

source: &Bookmarks
en: &Būkmarks

source: &Close
en: &Klos

source: &Copy
en: &Kopi

source: &Delete
en: &Dilit

source: &Done and Next
en: &Finišen en Nèist

source: &Done and next
en: &Finišen en nèist

source: &File
en: &Fayl

source: &GNU gettext Manual
en: &GNU gettext Mänyuol

source: &GNU gettext manual
en: &GNU gettext mänyuol

source: &Go
en: &Gou

source: &Group By Context
en: &Grūp Bai Kontekst

source: &Group by context
en: &Grūp bai kontekst

source: &Next >
en: &Nèist >

source: &Next Translation
en: &Nèist Transleiçion

source: &Next translation
en: &Nèist transleiçion

source: &Online Help
en: &Onlain Help

source: &Online help
en: &Onlain help

source: &Open...
en: &Opèn...

source: &Paste
en: &Peist

source: &Preferences
en: &Priförènses

source: &Previous Translation
en: &Priv Transleiçio

source: &Previous translation
en: &Priv transleiçion

source: &Purge Deleted Translations
en: &Pörj Diliten Transleiçions

source: &Purge deleted translations
en: &Pörj diliten transleiçions

source: &Redo
en: &Rīdiodio

source: &Replace
en: &Rīpleis

source: &Save
en: &Seiv

source: &Show References
en: &Displei Riförènses

source: &Show references
en: &Displei riförènses

source: &Statistics
en: &Stätistiks

source: &Undo
en: Ù&ndiodio

source: &Untranslated Entries First
en: &Mǐ-transleiten Entris Biforhänd
